app/controllers/categories_controller.rb

  def index
    @categories = @current_user.categories.paginate :page => params[:page] || 1
---
SELECT * FROM `categories` WHERE (`categories`.user_id = 1) LIMIT 0, 30

  def edit
    @category = @current_user.categories.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1 AND (`categories`.user_id = 1))

  def create
    @category = Category.new(params[:category])
	@category.color = "ffffff" if params[:category][:color].empty?
    @category.user = current_user

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`updated_at`, `title`, `color`, `user_id`, `created_at`) VALUES('2009-10-19 12:00:48', 'Супер', '#7E88DE', 1, '2009-10-19 12:00:48')

  def update
    @category = @current_user.categories.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 2 AND (`categories`.user_id = 1))
UPDATE `categories` SET `title` = '\"№\";\";\";', `color` = '8af766', `updated_at` = '2009-11-02 12:49:53' WHERE `id` = 6

  def destroy
    @category = @current_user.categories.find(params[:id])
    @category.destroy
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 5 AND (`categories`.user_id = 1))
DELETE FROM `categories` WHERE `id` = 5