app/controllers/home_controller.rb

  def day
    @categories = @current_user.categories

    if params[:day]
      @current_date = Date.civil(params[:year].to_i, params[:month].to_i, params[:day].to_i)
       else
      @current_date = Date.today
    end

    start_time = Time.local(@current_date.year, @current_date.month, @current_date.mday).getutc
    end_time = 1.day.from_now(@current_date)
	end_time = Time.local(end_time.year, end_time.month, end_time.mday).getutc
    @activities = @current_user.records.find(:all, :conditions => ["records.created_at >= ? AND records.created_at < ?", start_time, end_time], :order => "records.created_at DESC")
---
SELECT * FROM `categories` WHERE (`categories`.user_id = 1)
SELECT `records`.* FROM `records` INNER JOIN `categories` ON `records`.category_id = `categories`.id WHERE ((`categories`.user_id = 1) AND (records.created_at >= '2009-10-28 22:00:00' AND records.created_at < '2009-10-29 22:00:00')) ORDER BY records.created_at DESC

  def month_chart
    start_time_local = Time.local(params[:year].to_i, params[:month].to_i, 1)
    end_date_local = 1.month.from_now(Date.civil(start_time_local.year, start_time_local.month))
    end_date_local = Date.civil(end_date_local.year, end_date_local.month, 1)
    start_time = start_time_local.getutc
    end_time = Time.local(end_date_local.year, end_date_local.month).getutc

    categories = @current_user.records.find(:all, :select =>"sum(records.duration) as sum_duration, categories.*", :conditions => ["records.created_at >= ? AND records.created_at < ?", start_time, end_time], :group => "records.category_id")
---
SELECT sum(records.duration) as sum_duration, categories.* FROM `records` INNER JOIN `categories` ON `records`.category_id = `categories`.id WHERE ((`categories`.user_id = 1) AND (records.created_at >= '2009-09-30 21:00:00' AND records.created_at < '2009-10-31 22:00:00')) GROUP BY records.category_id

  def year_chart
    start_time_local = Time.local(params[:year].to_i)
    start_time = start_time_local.getutc
    end_time = 1.year.from_now(start_time)

    categories = @current_user.records.find(:all, :select =>"sum(records.duration) as sum_duration, categories.*", :conditions => ["records.created_at >= ? AND records.created_at < ?", start_time, end_time], :group => "records.category_id")
---
SELECT sum(records.duration) as sum_duration, categories.* FROM `records` INNER JOIN `categories` ON `records`.category_id = `categories`.id WHERE ((`categories`.user_id = 1) AND (records.created_at >= '2008-12-31 22:00:00' AND records.created_at < '2009-12-31 22:00:00')) GROUP BY records.category_id

  def range_chart
    start_time_local = Time.local(params[:start_year].to_i, params[:start_month].to_i, params[:start_day].to_i)
    start_time = start_time_local.getutc
    end_time_local = Time.local(params[:end_year].to_i, params[:end_month].to_i, params[:end_day].to_i)
    end_time = end_time_local.getutc

    categories = @current_user.records.find(:all, :select =>"sum(records.duration) as sum_duration, categories.*", :conditions => ["records.created_at >= ? AND records.created_at < ?", start_time, end_time], :group => "records.category_id")
---
SELECT sum(records.duration) as sum_duration, categories.* FROM `records` INNER JOIN `categories` ON `records`.category_id = `categories`.id WHERE ((`categories`.user_id = 1) AND (records.created_at >= '2009-10-24 21:00:00' AND records.created_at < '2009-10-25 22:00:00')) GROUP BY records.category_id