app/controllers/records_controller.rb

SELECT * FROM `records`
---
  def index
    @records = Record.all

SELECT * FROM `records` WHERE (`records`.`id` = 45)
---
  def show
    @record = Record.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = '1') LIMIT 1
INSERT INTO `records` (`updated_at`, `category_id`, `duration`, `comment`, `created_at`) VALUES('2009-10-19 21:26:18', 1, 150, 'срав', '2009-10-19 21:26:18')
---
  def create
    @record = Record.new(params[:record])
    @record.category = Category.find_by_id params[:category_id]
    duration = params[:record][:duration].split(':', -1)
    if duration.size > 1
      @record.duration = duration[0].to_i * 60 + duration[1].to_i
    end

    render :update do |page|
      if @record.save

SELECT * FROM `records` WHERE (`records`.`id` = 45)
DELETE FROM `records` WHERE `id` = 45
---
  def destroy
    @record = Record.find(params[:id])
    @record.destroy