app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `remember_token`, `time_zone`, `login`, `email`, `created_at`) VALUES('', '07da4290f6b3d2f65c077cac2a45c8559f78d64a', '2009-10-25 21:44:35', NULL, 'ef4c2516532dbb5be8f064845c5420fb677a00d0', NULL, '8aadde05c5393ba16819ff01b6c7f1351668ea83', NULL, 'Kyev', 'Петро', 'petro@petro.com', '2009-10-25 21:44:35')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
	@user.time_zone = 'Kyev'
    success = @user && @user.save

UPDATE `users` SET `time_zone` = 'Samoa', `updated_at` = '2009-10-25 18:05:57' WHERE `id` = 1
---
  def update
    @user = current_user
    @user.time_zone = params[:user][:time_zone]
    success = @user && @user.save